{
    "contract": {
        "template": "CONTRACT \n\nThis Contract Agreement is made and entered into on this {contract_date} between:\n\n1. {party_1}, a company/individual duly incorporated/registered and existing under the laws of Kenya, with its principal office at {address_1}, hereinafter referred to as the \"First Party\";\n\n2. {party_2}, a company/individual duly incorporated/registered and existing under the laws of Kenya, with its principal office at {address_2}, hereinafter referred to as the \"Second Party\";\n\nEach individually referred to as a \"Party\" and collectively as the \"Parties.\"\n\nWHEREAS:\n- The First Party is desirous of engaging the Second Party for the provision of {project_description} services as described in this Agreement.\n- The Second Party has represented and warranted that it possesses the requisite skills, expertise, and resources to undertake the services set forth herein.\n\nNOW, THEREFORE, in consideration of the mutual promises, terms, and covenants herein contained, the Parties hereby agree as follows:\n\nARTICLE 1: DEFINITIONS\n1.1 \"Agreement\" means this Contract Agreement, including any annexures and schedules.\n1.2 \"Contract Price\" means the total sum of {contract_price}, payable as set out in Article 4.\n1.3 \"Effective Date\" means the date of execution of this Agreement.\n\nARTICLE 2: SCOPE OF WORK\n2.1 The Second Party agrees to perform the following services: {scope_of_work}.\n2.2 The Second Party shall execute the work in compliance with the timelines and standards specified in Schedule A annexed hereto.\n\nARTICLE 3: TERM AND TERMINATION\n3.1 The term of this Agreement shall commence on {start_date} and shall continue until {end_date}, unless earlier terminated as provided herein.\n3.2 Either Party may terminate this Agreement upon thirty (30) days written notice to the other Party or immediately for cause.\n\nARTICLE 4: PAYMENT TERMS\n4.1 The First Party shall pay the Contract Price to the Second Party in the following manner:\n(a) Advance Payment: {advance_payment}.\n(b) Balance Payment: {balance_payment} upon completion of the services to the satisfaction of the First Party.\n4.2 Payments shall be made by bank transfer to the account designated by the Second Party.\n\nARTICLE 5: CONFIDENTIALITY\n5.1 Both Parties agree to keep confidential all proprietary and non-public information exchanged in connection with this Agreement.\n\nARTICLE 6: GOVERNING LAW\n6.1 This Agreement shall be governed by and construed in accordance with the laws of the Republic of Kenya.\n\nIN WITNESS WHEREOF, the Parties have executed this Agreement as of the date first above written.\n\nSIGNED:\n\nFor and on behalf of the First Party:\nName: __________________________  Title: ________________________  Signature: _______________________\n\nFor and on behalf of the Second Party:\nName: __________________________  Title: ________________________  Signature: _______________________"
    },
    "affidavit": {
        "template": "REPUBLIC OF KENYA\n\nIN THE MATTER OF THE OATHS AND STATUTORY DECLARATIONS ACT\n\n(CAP 15 OF THE LAWS OF KENYA)\n\nAFFIDAVIT\n\nI, {full_name}, of Kenyan Identity Card Number {id_number} and of Post Office Box Number {post_box} in the Republic of Kenya, do hereby make oath and state as follows: -\n\n1. THAT I am a {gender} adult of sound mind, competent to make and swear this affidavit.\n\n2. THAT {statement_1}\n\n3. THAT {statement_2}\n\n4. THAT {statement_3}\n\n5. THAT {statement_4}\n\n6. THAT {statement_5}\n\n7. THAT what is deponed herein above is true to the best of my knowledge, information, and belief.\n\nSWORN at {location} by the said\n\n{full_name}\n\nDEPONENT\n\nThis {day} day of {month} {year}\n\nBEFORE ME\n\nCOMMISSIONER FOR OATHS"
    }
}